app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 2) #.where(created_at: :desc)
---
SELECT  "articles".* FROM "articles" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def update
    if @article.update article_params
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "An article a"], ["updated_at", "2016-01-12 08:10:41.780997"], ["id", 1]]

  def set_article
    @article = Article.find params[:id]
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]