app/controllers/users_controller.rb

  def index
		@users = User.paginate(page: params[:page], per_page: 2)
---
SELECT  "users".* FROM "users" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new user_params
      if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
		@user_articles = @user.articles.paginate(page: params[:page], per_page: 2)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT 2 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]

	def set_user
		@user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]